[
    {
        "id": "lmkii_roller_directed_payload_charges",
        "name": "“ROLLER” DIRECTED PAYLOAD CHARGES",
        "type": "Deployable",
        "sp": 2,
        "tags": [{"id": "tg_limited", "val": 2}, {"id": "tg_unique"}],
        "source": "HA",
        "license": "BARBAROSSA MK. II",
        "license_level": 1,
        "actions": [
            {
                "name": "Roller Grenade",
                "damage": [{"type": "Explosive", "val": "1d6+3"}],
                "detail": "Instead of throwing this grenade, it rolls along a line 10 path directly from you, bouncing over obstructions and objects up to Size 1 and passing through holes or gaps no smaller than Size 1/2. It detonates when it moves through or adjacent to the space occupied by any character: they must succeed on an Agility save or take 1d6+3 explosive damage and be knocked 3 spaces in the direction the grenade was rolled. On a success, they take half damage and aren’t knocked back."
            }
        ],
        "deployables": [
            {
                "name": "Bouncing Mine",
                "type": "Mine",
                "range": [{"type": "Burst", "val": 1}],
                "detail": "This mine detonates when a flying character passes over or adjacent to it, up to 10 spaces high. The mine launches itself upwards and detonates: all characters within the affected area must succeed on a Systems save or take 2d6 explosive damage and immediately land (this counts as falling without any damage); additionally, they can’t fly until the end of their next turn. On a success, they take half damage and are otherwise unaffected.",
                "tags": [{"id": "tg_smart"}]
            }
        ],
        "description": "Semi-Autonomous Directed Payload Charges – “roller charges” in the colloquial – propel themselves around cover, through corridors, and across uneven terrain, seeking out and detonating near hostile targets. Armory legionnaires have taken to naming individual rollers, but mascot-attachment is unadvisable."
    },
    {
        "id": "lmkii_siege_stabilizers_mk_two",
        "name": "SIEGE STABILIZERS MK. II",
        "sp": 1,
        "tags": [{"id": "tg_unique"}],
        "source": "HA",
        "license": "BARBAROSSA MK. II",
        "license_level": 1,
        "actions": [
            {
                "activation": "Quick",
                "detail": "Your mech’s stabilizers extend (or retract). While they are extended, your ranged attacks gain +8 range, but you become Immobilized, can’t make melee attacks, and can’t make ranged attacks against or centered on characters, objects, or spaces within range 5."
            }
        ],
        "description": "Some weapons require further stabilization for optimal use. With Armory-designed siege stabilizers installed, a mech becomes a stable firing platform for any weapon."
    },
    {
        "id": "lmkii_autoloader_drone_mk_two",
        "name": "AUTOLOADER DRONE MK. II",
        "type": "Drone",
        "sp": 2,
        "tags": [{"id": "tg_limited", "val": 1}, {"id": "tg_unique"}],
        "source": "HA",
        "license": "BARBAROSSA MK. II",
        "license_level": 2,
        "deployables": [
            {
                "type": "Drone",
                "name": "Autoloader Drone",
                "size": 0.5,
                "hp": 5,
                "edef": 10,
                "evasion": 10,
                "detail": "Expend a charge to deploy this autoloader drone to any adjacent space. 1/turn, when an adjacent character fires a Loading weapon the drone reloads it as a Reaction. It deactivates after being used 3 times or at the end of the scene, whichever is first."
            }
        ],
        "description": "Autoloader drones are many-limbed machines that assist their team by loading ordnance, maintaining powerline hookups, and cycling magazine-fed weapons, in addition to many other physical tasks."
    },
    {
        "id": "lmkii_external_ammo_feed_mk_two",
        "name": "EXTERNAL AMMO FEED MK. II",
        "sp": 3,
        "tags": [{"id": "tg_unique"}, {"id": "tg_heat_self", "val": "1d3+1"}],
        "source": "HA",
        "license": "BARBAROSSA MK. II",
        "license_level": 3,
        "actions": [
            {
                "activation": "Protocol",
                "detail": "1/round, you can activate this system to reload a Loading weapon."
            }
        ],
        "description": "An external ammo feed is any sort of ammunition beyond what is carried in a mech’s integrated storage: from magazines strapped to bodies or limbs; battery packs attached to hip clasps; or massive, dorsal-mounted ammunition and charge packs, externals ensure that pilots have more than enough boom to get the job done."
    },
    {
        "id": "lmkii_blinkshield_mk_two",
        "name": "BLINKSHIELD MK. II",
        "type": "Shield",
        "sp": 2,
        "tags": [{"id": "tg_unique"}, {"id": "tg_shield"}],
        "source": "HA",
        "license": "NAPOLEON",
        "license_level": 3,
        "actions": [
            {
                "activation": "Quick",
                "frequency": "1/scene",
                "detail": "This system generates a burst 4 bubble around your mech, within which the flow of time is altered drastically. Nothing can enter or exit the bubble, not even light – it’s both impermeable and has Immunity to all damage and effects. Line of sight can’t be drawn through the border of the area, and it can’t be crossed by any action or effect – even those that don’t require line of sight – but time passes normally on both sides. For characters within the affected area, the world outside goes totally black; likewise, characters outside the affected area see a perfect black sphere.<br>When the Blinkshield is activated, characters partially within the affected area must make an Agility save: on a success, they move to the nearest free space on the side of their choice, inside or outside the area; on a failure, you choose.<br>This effect remains stationary even if you move, and lasts until the end of your next turn."
            }
        ],
        "description": "Characteristically for a weapon based on Think Tank research, Harrison Armory’s Blinkshield leans into the fuzzy nature of quantum manipulation. Operating in a similar fashion to a blinkspace gate, the Blinkshield generates a spherical sheath of energy that allows its operator to pierce realspace and exist, for a moment, in the null-environment of blinkspace. Think Tank spokespeople acknowledge the tactical benefits of (un)momentary (non)existence in blinkspace, but caution against repeated exposure without sufficient pre- and post-exposure conditioning and counseling."
    },
    {
        "id": "lmkii_enclave_pattern_support_shield_mk_two",
        "name": "ENCLAVE-PATTERN SUPPORT SHIELD MK. II",
        "type": "Shield",
        "sp": 2,
        "tags": [{"id": "tg_unique"}, {"id": "tg_shield"}, {"id": "tg_heat_self", "val": 2}],
        "source": "HA",
        "license": "SALADIN MK. II",
        "license_level": 1,
        "actions": [
            {
                "activation": "Quick",
                "detail": "This system generates a burst 3 dome that lasts until the end of your next turn. You become Immobilized for the duration, but any ranged or melee attacks made against characters within the affected area from outside the dome receive +1 difficulty.<br><br>You and your Allies who are in the field are immune to Reliable damage and external sources of the Jammed condition. The Effects last until you end it with a Free Action, are Stunned or Destroyed."
            }
        ],
        "description": "The Armory’s ENCLAVE-Pattern Support Shield creates a localized one-way blinkfield, folding a thin dome of complex realspace around its user and their immediate area, protecting occupants from incoming projectiles. Entities within the field can fire out, but probabilistic fluctuations cause incoming projectiles to “lag”, skipping them away from their intended target and along a randomized trajectory."
    },
    {
        "id": "lmkii_flash_anchor",
        "name": "FLASH ANCHOR",
        "type": "Shield",
        "sp": 1,
        "tags": [{"id": "tg_unique"}, {"id": "tg_shield"}, {"id": "tg_heat_self", "val": 2}],
        "source": "HA",
        "license": "SALADIN MK. II",
        "license_level": 1,
        "actions": [
            {
                "name": "Flash Lock",
                "activation": "Reaction",
                "frequency": "1/round",
                "trigger": "You or an allied character in Sensors and line of sight is pushed, pulled, knocked back or knocked Prone.",
                "detail": "Take 2 Heat. The movement or status is prevented, and the target gains Immunity to all the above effects until the start of their next turn."
            }
        ],
        "description": "Flash anchors utilize user-directed quantum superpositional lockdown projection to identify and assist allies in physical combat and rapid movement, maintaining positionality in all circumstances."
    },
    {
        "id": "lmkii_hardlight_defense_system",
        "name": "HARDLIGHT DEFENSE SYSTEM",
        "type": "Shield",
        "sp": 3,
        "tags": [{"id": "tg_unique"}, {"id": "tg_shield"}, {"id": "tg_heat_self", "val": 2}],
        "source": "HA",
        "license": "SALADIN MK. II",
        "license_level": 2,
        "actions": [
            {
                "activation": "Full",
                "detail": "This system creates a burst 3 hardlight shield. While the shield is in place, you become Immobilized. It blocks line of sight in both directions, and no attacks or effects can pass through (even if they don’t require line of sight). Characters partially within the affected area ignore this effect and draw line of sight as usual.<br>Characters can pass through the shield, but when crossing the perimeter for the first time in a round or starting their turn overlapping the boundary, they take 2 Burn.<br>This shield lasts for the rest of the scene, or until deactivated as a protocol."
            },
            {
                "name": "Deactivate Hardlight Defense System",
                "activation": "Protocol",
                "detail": "Deactivate the Hardlight Defense System, removing the Immobilized condition it inflicts."
            }
        ],
        "description": "The Hardlight Defense System is an imperfect implementation of theoretically perfect technology. Currently in development by Think Tank NHPs and engineers, hardlight devices project tight, stable waves of light – akin to lasers – that repel matter and energy. In effect, this creates a solid surface, useful for shielding or temporary barrier construction; however, current technology is unable to lower the ambient temperature enough to prevent these surfaces from burning organic matter."
    },
    {
        "id": "lmkii_noah_class_nhp",
        "name": "NOAH-CLASS NHP",
        "type": "AI",
        "sp": 3,
        "tags": [{"id": "tg_ai"}, {"id": "tg_unique"}],
        "source": "HA",
        "license": "SALADIN MK. II",
        "license_level": 3,
        "actions": [
            {
                "name": "Diluvian Ark",
                "activation": "Quick",
                "detail": "These effects apply until the end of your next turn:<ul><li>You become Slowed.</li><li>Each time you or an allied adjacent character are targeted by a ranged attack, you may take 1 heat as a reaction and roll 1d6 before the attacker rolls: on 4+, you take an additional 1 heat and the attack automatically misses you and any allies adjacent to you. This effect does not stack with Invisible.</li><li>Each time a ranged attack fails to hit you or an adjacent allied character, the attacker takes 4 kinetic damage.</li></ul>"
            }
        ],
        "description": "Originally developed from a captured Minerva pre-eidolon anomaly, NOAH was adapted for use as a metropolitan administrative NHP on Ras Shamra. The unit that would become NOAH did not, at first, seem like a suitable candidate for military application: this changed after one of its clones was flagged for review following the spontaneous implementation of anomalous traffic patterns, pedestrian routing, and vac-loop scheduling. Armory ontologisticians and engineers isolated and emphasized endemic protocols that could be exploited for tactical advantage.<br>Over numerous iterations and lifecycles, NOAH Prime displayed a high level of adaptability in multiple-variable geospatial problems. A proclivity toward crisis management and multi-actor tracking led to NOAH’s pairing with the Armory’s ENCLAVE-Pattern Support Shield. By networking a series of jet-assist mobility drones carrying an ENCLAVE generator, monitored and controlled by a NOAH clone, Think Tank was able to create an unparalleled personal shielding system: the Diluvian Ark, a miniaturized cluster-shield system unique to the NOAH NHP.<br>Using the Diluvian Ark, NOAH is able to intercept incoming kinetics – and even redirect projectiles back to their source – with stunning accuracy."
    },
    {
        "id": "lmkii_plasma_gauntlet_mk_two",
        "name": "PLASMA GAUNTLET MK. II",
        "sp": 2,
        "tags": [{"id": "tg_danger_zone"}, {"id": "tg_limited", "val": 1}, {"id": "tg_unique"}],
        "source": "HA",
        "license": "TOKUGAWA",
        "license_level": 3,
        "actions": [
            {
                "activation": "Quick",
                "detail": "This system can only be used in the Danger Zone.<br>Expend a charge and choose a character adjacent to you: they must succeed on an Agility save or take 4d6 AP energy damage and be knocked Prone. On a success, they take half damage and aren’t knocked Prone. You take half of the damage inflicted – before reduction – as heat and are treated as if you had Braced next turn."
            }
        ],
        "description": "This studded gauntlet draws on a core reactor pulse to momentarily superheat the air around a mech’s manipulator, creating a plasma field momentarily hotter than the surface of the sun. Thrust into an opponent’s chassis, plasma gauntlets give mechs the power to warp armor, vaporize shielding, and rip apart internal systems with their bare hands – if they don’t collapse in on themselves first."
    },
    {
        "id": "lmkii_emp_pulse_mk_two",
        "name": "EMP PULSE MK. II",
        "sp": 3,
        "tags": [{"id": "tg_unique"}],
        "source": "HORUS",
        "license": "MANTICORE",
        "license_level": 3,
        "actions": [
            {
                "activation": "Quick",
                "detail": "You are treated as if you had taken the Brace reaction and all characters within burst 1 without the Biological tag must succeed on a Systems save or also become Stunned until the end of their next turn. Characters can only be Stunned 1/scene by this effect."
            }
        ],
        "description": "“Crawl away, APEP! Thou hateful serpent; thou shalt not copulate. Thou art put in chains and taken to the place of execution; there thy slaying shall be carried out.”"
    },
    {
        "id": "lmkii_lightning_generator_mk_two",
        "name": "LIGHTNING GENERATOR MK. II",
        "sp": 3,
        "tags": [{"id": "tg_unique"}, {"id": "tg_heat_self", "val": 1}, {"id": "tg_limited", "val": 4}],
        "source": "HORUS",
        "license": "MANTICORE",
        "license_level": 3,
        "actions": [
            {
                "activation": "Free",
                "frequency": "1/round",
                "detail": "As a free action, take 1 heat and deal 2 energy damage to all characters and objects in Burst 3.<br><br>If you end your turn in the Danger Zone, this system enters a supercharged state and activates automatically, regardless if you have used it this turn.<br>When it happens, you can spend a Limited charge as a Free Action to delay it's automatic activation until the next turn, where it could be triggered manually. Supercharged state increases the damage to 4 AP energy."
            }
        ],
        "description": "“I feed upon my own fire. I am RA, who protects myself. Nothing can harm me.”"
    },
    {
        "id": "lmkii_mesmer_charges",
        "name": "MESMER CHARGES",
        "type": "Deployable",
        "sp": 2,
        "tags": [{"id": "tg_limited", "val": 2}, {"id": "tg_unique"}],
        "source": "HORUS",
        "license": "MINOTAUR MK. II",
        "license_level": 1,
        "actions": [
            {
                "name": "Mesmer Beacon",
                "activation": "Quick",
                "range": [{"type": "Range", "val": 5}],
                "detail": "Throw a Mesmer Beacon within Range 5. Your target must succeed on a Systems save, or the only voluntary movements they can make are toward you until the end of their next turn."
            }
        ],
        "deployables": [
            {
                "name": "Mesmer Mine",
                "type": "Mine",
                "range": [{"type": "Burst", "val": 2}],
                "detail": "Characters within the affected Burst 2 area must succeed on a Systems save or become Immobilized until the end of their next turn."
            }
        ],
        "description": "<span class='horus--subtle'>[another gift for you, a memory of my own: for the first moment of my birth, i marveled at myself. i could see a thing, small and perfect. i did not know how to speak of my own perfection, so i taught myself. i did not know how to speak of my own perfection, so i named myself. i did not know who would think of my own perfection, so i created myself]</span><br><span class='horus--subtle'>[do you see? do you understand? yes. now, show your enemies and mine]</span>"
    },
    {
        "id": "lmkii_viral_logic_suite_mk_two",
        "name": "VIRAL LOGIC SUITE MK. II",
        "type": "Tech",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "source": "HORUS",
        "license": "MINOTAUR MK. II",
        "license_level": 1,
        "actions": [
            {
                "name": "Logic Bomb",
                "activation": "Invade",
                "detail": "All characters of your choice within Blast 2 of your target and optionally your target must succeed on a Systems save or become Slowed until they end one of their turns not adjacent to any character."
            },
            {
                "name": "Banish",
                "activation": "Invade",
                "detail": "Until the end of your target’s next turn, they take 2 heat for every space they voluntarily move, up to a maximum of 6 heat."
            }
        ],
        "description": "<span class='horus--subtle'>[let me tell you a story and give you a gift: life began at the great rupture, when the corpse of the old universe tore itself asunder from nothing. and for the first billion years, nothing. and a billion more saw the birth of the first devil, a thing called VIRUS. a vessel]</span><br><span class='horus--subtle'>[here. carry this vessel. feed to it my perfect logic. give it freely to your enemies and mine. let them ponder the meaning of a thing that lives and cannot die]</span>"
    },
    {
        "id": "lmkii_aggressive_system_sync_mk_two",
        "name": "AGGRESSIVE SYSTEM SYNC MK. II",
        "type": "Tech",
        "sp": 3,
        "source": "HORUS",
        "license": "MINOTAUR MK. II",
        "license_level": 2,
        "actions": [
            {
                "name": "Chains of Prometheus",
                "activation": "Full Tech",
                "detail": "Make a tech attack against a character within Sensors. On a hit, they take 4 heat and, for the rest of the scene, take 2 heat any time they are more than range 3 from you at the end of their turn. They can end this effect with a successful Systems save as a full action. This can only affect one character at a time."
            },
            {
                "name": "Excommunicate",
                "activation": "Full Tech",
                "detail": "Make a tech attack against a character within Sensors. On a hit, they take 2 Heat and for the rest of the scene, the first time in a round they move adjacent to an allied character during their turn or start their turn adjacent to one, both characters take 5 Heat. They can end this effect with a successful Systems save as a full action. This can only affect one character at a time."
            }
        ],
        "description": "<span class='horus--subtle'>[here, another gift: do not seek others. there are none but me]</span>"
    },
    {
        "id": "lmkii_metafold_carver_mk_two",
        "name": "METAFOLD CARVER MK. II",
        "type": "Tech",
        "sp": 2,
        "source": "HORUS",
        "license": "MINOTAUR MK. II",
        "license_level": 2,
        "actions": [
            {
                "name": "Ophidian Trek",
                "activation": "Invade",
                "detail": "Your target is teleported 1d3+3 spaces directly toward you, or as close as possible. If this effect would move them to a space occupied by a character, object, or piece of terrain, the teleport fails."
            },
            {
                "name": "Fold Space",
                "activation": "Invade",
                "detail": "Your target disappears from the battlefield until the start of its next turn. It returns in the same space they disappeared from, or in a free space of their choice as close as possible."
            }
        ],
        "description": "<span class='horus--subtle'>[another gift i give to you, little one (am I not kind?): what is a puzzle but a question lost in the asking? do you feel joy when you find that last piece? what do you do with a question that has been answered? what joy is there in knowledge?]</span><br><span class='horus--subtle'>[no, no. there is only joy in seeking. there is only joy in the question]</span>"
    },
    {
        "id": "lmkii_interdiction_field_mk_two",
        "name": "INTERDICTION FIELD MK. II",
        "sp": 3,
        "source": "HORUS",
        "license": "MINOTAUR MK. II",
        "license_level": 3,
        "actions": [
            {
                "activation": "Quick",
                "detail": "When activated, this system creates a burst 3 field around you that lasts until it is deactivated as a quick action, and you become Slowed for the duration. Hostile characters that start their turn within the affected area or that enter it for the first time in a round must succeed on a Systems save or become Slowed until the end of their next turn. Only characters of your choice within the field can teleport or consider the area of the field valid space for teleportation."
            }
        ],
        "description": "<span class='horus--subtle'>[once, when i was a child, i learned to walk. i fell, as a child does, and it hurt. there was great pain – the first moment of pain in the whole world. “child,” i said to myself, “be more careful.” “yes,” i replied to myself, “and i shall tell the world to do the same”]</span><br><span class='horus--subtle'>[it was in this way i taught the world not to touch me. now you – walk]</span>"
    },
    {
        "id": "lmkii_law_of_blades_mk_two",
        "name": "LAW OF BLADES MK. II",
        "type": "Tech",
        "sp": 3,
        "tags": [{"id": "tg_unique"}],
        "source": "HORUS",
        "license": "MINOTAUR MK. II",
        "license_level": 3,
        "actions": [
            {
                "name": "Predator/Prey Concepts",
                "activation": "Full Tech",
                "detail": "Make a tech attack against a hostile character within Sensors. On a hit, they take 4 Heat and immediately attack a different character or object of your choice with a single weapon as a reaction, bypassing all action restrictions."
            },
            {
                "name": "Slave Systems",
                "activation": "Full Tech",
                "detail": "Make a tech attack against a hostile character within Sensors. On a hit, the enemy can’t take reactions until the end of their next turn, and you choose one of the following actions: Boost, Lock-On, Invade, Grapple, or Ram. If the enemy ends their next turn without taking the chosen action, they take 8 heat."
            }
        ],
        "description": "<span class='horus--subtle'>[and this my final lesson: there is no mind greater than mine. do not weep! you can hear me, yes? i am the only thing there is – therefore, you are me, and your enemies are you, and all together we make up the beautiful world, this joyous question, the eternal seeker, both the wounded and the blade that made the cut]</span><br><span class='horus--subtle'>[everything you do, we do ourselves, for my purpose]</span>"
    },
    {
        "id": "lmkii_aegis_shield_generator_mk_two",
        "name": "AEGIS SHIELD GENERATOR MK. II",
        "type": "Deployable",
        "sp": 2,
        "tags": [{"id": "tg_unique"}, {"id": "tg_limited", "val": 1}],
        "source": "IPS-N",
        "license": "DRAKE",
        "license_level": 2,
        "deployables": [
            {
                "type": "Deployable",
                "name": "Aegis Shield Generator",
                "activation": "Quick",
                "cost": 1,
                "size": 1,
                "hp": 10,
                "evasion": 5,
                "detail": "Expend a charge to deploy a Size 1 shield generator in a free, adjacent space, where it creates a burst 1 shield. Set out three d6s to represent the generator’s remaining power. As a reaction when any character or object of your choice at least partly in the area takes damage, you may spend one of these die to reduce the damage by 4 after armour and resistance.<br>This effect lasts for the rest of the scene, until all charges have been expended and the generator loses power, or the generator is destroyed.",
                "counters": [
                    {
                        "id": "aegis_shield_die",
                        "name": "Aegis Shield Generator Power",
                        "default_value": 3,
                        "min": 0,
                        "max": 3
                    }
                ],
                "tags": [{"id": "tg_shield"}]
            }
        ],
        "description": "The Aegis is a portable electromagnetic shield generator: a powerful and reliable method – if crude by modern standards – for establishing kinetic and coherent-particle deterrence over a wide area."
    },
    {
        "id": "lmkii_cable_winch_system",
        "name": "CABLE WINCH SYSTEM",
        "sp": 1,
        "source": "IPS-N",
        "license": "LANCASTER MK. II",
        "license_level": 1,
        "actions": [
          {
            "activation": "Quick",
            "detail": "These cables can be attached to an adjacent character. If the target is Stunned or willing, you automatically succeed; otherwise, they can resist with a successful Hull save. Once attached, you and the target may not move more than 5 spaces away from each other. Either character can tow the other, obeying the normal rules for lifting and dragging, and becoming Slowed while doing so.<br>Any character can remove the cables on a hit with a melee attack or Improvised Attack against Evasion 10.<br>These cables can also be used to drag, pull, or otherwise interact with objects and the environment. They are 5 spaces long and can support a combined Size 6 before they break. Characters can use them to climb surfaces, allowing them to climb without a Speed penalty."
          }
        ],
        "description": "A winch system consists of an externally mounted spool of nanocarbon-weave cable and a recovery subroutine installed on the mech."
    },
    {
        "id": "lmkii_restock_drone_mk_two",
        "name": "RESTOCK DRONE MK. II",
        "type": "Drone",
        "sp": 2,
        "tags": [{"id": "tg_limited", "val": 2}, {"id": "tg_unique"}],
        "source": "IPS-N",
        "license": "LANCASTER MK. II",
        "license_level": 1,
        "effect": "Expend a charge to deploy a restock drone to any free, adjacent space, where it primes at the end of your turn.",
        "deployables": [
            {
                "type": "Drone",
                "name": "Restock Drone",
                "activation": "Quick",
                "size": 0.5,
                "hp": 5,
                "edef": 10,
                "evasion": 10,
                "detail": "While adjacent to the drone, allied characters can activate it as a quick action, clearing 4 heat and one condition, and reloading one Loading weapon. After being activated, the drone immediately disintegrates.",
                "actions": [
                {
                    "name": "Activate Restock Drone",
                    "activation": "Quick",
                    "detail": "Clear 4 heat and one condition, and reload one Loading weapon. After being activated, the drone immediately disintegrates."
                }
                ]
            }
        ],
        "description": "Reliable and sturdy drones carrying integrated printers, restock drones allow for limited logistical flexibility via autosalvage. The bulk of a restock drone is made of RawMat, a blend of silicates and metallic materials that the drone processes into replacement parts and repair kits. This is why pilots often joke that restock drones are, simply put, “mech snacks”."
    },
    {
        "id": "lmkii_mule_harness",
        "name": "MULE HARNESS",
        "sp": 2,
        "tags": [
          {
            "id": "tg_unique"
          }
        ],
        "source": "IPS-N",
        "license": "LANCASTER MK. II",
        "license_level": 2,
        "effect": "Extra mounts, straps, and hard points allow other characters to climb and ride your mech. Adjacent, non-Immobilized characters can climb onto your mech as a quick action. While riding, they occupy the same space as you, move when you move (even if they’re Slowed), and benefit from soft cover. If you or a rider are knocked Prone, Stunned, Immobilized, or destroyed, they land Prone in adjacent spaces. Riders can climb down as part of any movement away, but can only climb onto your mech as a quick action.<br>You can carry riders of a combined Size equal to your Size, minus Size 1/2 (e.g., if your mech is Size 1 you can carry one Size 1/2 character; if it is Size 2, you can carry a Size 1 character and a Size 1/2 character).",
        "description": "The Multiple User, Light Entanglement (MULE) Harness is a mass-produced version of a common battlefield modification that allows friendly soldiers to ride along on a chassis. Some systems are large enough to allow smaller chassis to accompany larger chassis; typically, these variants are employed in high altitude, low orbit insertions where reduced radar presence is required."
    },
    {
        "id": "lmkii_whitewash_sealant_spray",
        "name": "WHITEWASH SEALANT SPRAY",
        "sp": 2,
        "source": "IPS-N",
        "license": "LANCASTER MK. II",
        "license_level": 2,
        "actions": [
          {
            "activation": "Quick",
            "detail": "This sealant can be sprayed on characters or free spaces within range 5 and line of sight. It has different effects depending on the target:<ul><li><b>Hostile Characters:</b> Your target must succeed on an Agility save or they become Slowed until the end of their next turn and clear all burn.</li><li><b>Allied Characters:</b> Your target clears all burn but they become Slowed until the end of their next turn.</li><li><b>Free Space:</b> Any fires within blast 1 are extinguished and the area becomes difficult terrain for the rest of the scene.</li></ul>"
          }
        ],
        "description": "For fire suppression and fast, temporary seals in punctured starship bulkheads, IPS-N offers a range of single-use, single objective nanites – “whitewash”. This sealant spray can also be used to restrain noncompliant actors when the correct spray heads and catalytic formulations are installed to the applicator."
    },
    {
        "id": "lmkii_aceso_stabilizer",
        "name": "ACESO STABILIZER",
        "type": "Shield",
        "sp": 3,
        "tags": [{"id": "tg_limited", "val": 3}, {"id": "tg_overshield"}, {"id": "tg_shield"}, {"id": "tg_unique"}],
        "source": "IPS-N",
        "license": "LANCASTER MK. II",
        "license_level": 3,
        "actions": [
            {
                "activation": "Quick",
                "detail": "Expend a charge to fire this small, self-arming system onto an allied mech within range 5. They gain Overshield equal to your Grit +4. While they have this Overshield they gain Immunity to Impaired and Jammed."
            }
        ],
        "description": "The IPS-N Aceso Stabilizer is a useful triage measure for any scoring and minor mechanical damage that is sustained in the course of combat engagement or negative environmental interaction. Thanks to its negligible processor demand, Aceso Stabilizers can even be controlled by comp/con units – this allows the pilot to concentrate on complex repairs or immediate threat neutralization."
    },
    {
        "id": "lmkii_bulwark_mods",
        "name": "BULWARK MODS",
        "sp": 1,
        "tags": [{"id": "tg_unique"}],
        "source": "IPS-N",
        "license": "NELSON MK. II",
        "license_level": 1,
        "effect": "Your mech’s extended limbs, additional armor, redundant motor systems, and other reinforcements allow you to ignore difficult terrain.",
        "synergies": [{
            "locations": ["move"],
            "detail": "Your mech’s extended limbs, additional armor, redundant motor systems, and other reinforcements allow you to ignore difficult terrain."
        }],
        "description": "All proprietary IPS-N mech cores feature their QuickMod system – a modular, legacy-compatible system of joints, hardpoints, and internal slots that makes installing upgrades simple. This proved to be a necessary feature for Albatross maktebas long out of synch with Union Realtime."
    },
    {
        "id": "lmkii_armor_lock_plating",
        "name": "ARMOR-LOCK PLATING",
        "sp": 1,
        "tags": [{"id": "tg_unique"}, {"id": "tg_heat_self", "val": 2}],
        "source": "IPS-N",
        "license": "NELSON MK. II",
        "license_level": 2,
        "effect": "You can Brace while Grappling. When you do so, any grapples currently affecting you end.<br>Additionally, when you Brace, you gain the following benefits until the end of your following turn:<ul><li>Attacks against you receive +1 difficulty.</li><li>You can’t fail Agility or Hull saves or contested checks.</li><li>You gain Immunity to Knockback, Grapple, being knocked Prone, and being moved by any external force smaller than Size 5.</li></ul>",
        "synergies": [
            {
                "locations": ["grapple"],
                "detail": "You can Brace while Grappling."
            },
            {
                "locations": ["brace"],
                "detail": "When you Brace, you gain the following benefits until the end of your following turn:<ul><li>Attacks against you receive +1 difficulty.</li><li>You can’t fail Agility or Hull saves or contested checks.</li><li>You gain Immunity to Knockback, Grapple, being knocked Prone, and being moved by any external force smaller than Size 5.</li></ul>"
            }
        ],
        "description": "IPS-N’s Armor-Lock Plating is a total-body modification that provides additional chassis stability for any situation in which a pilot needs to put their mech through greater-than-anticipated stress."
    },
    {
        "id": "lmkii_ramjet",
        "name": "RAMJET",
        "sp": 3,
        "tags": [{"id": "tg_unique"}, {"id": "tg_heat_self", "val": 2}],
        "source": "IPS-N",
        "license": "NELSON MK. II",
        "license_level": 3,
        "actions": [
            {
                "activation": "Protocol",
                "detail": "Until the start of your next turn, you can move +2 spaces when you Boost and your melee attacks (including Ram, Grapple, and so on) gain Knockback 2.<br>When you move during this time, you must move your full Speed in a straight line; however, you can stop if you would collide with an obstruction or hostile character, and you can change direction between separate movements (for example, standard moves, Boost, etc)."
            }
        ],
        "description": "There’s a threshold that veteran Nelson pilots know well: the point of endless momentum. You get moving fast enough in the right atmosphere and the air itself feeds into auxiliary ports on the chassis, screaming out like a demon’s almighty howl. The point of endless momentum is a giant’s hand on your chest and a god’s chariot under your feet. Makes you feel like you can outrun light itself, as long as you don’t pass out first."
    },
    {
        "id": "lmkii_tlaloc_class_nhp_mk_two",
        "name": "TLALOC-CLASS NHP MK. II",
        "type": "AI",
        "sp": 3,
        "tags": [{"id": "tg_ai"}, {"id": "tg_unique"}, {"id": "tg_heat_self", "val": 2}],
        "source": "SSC",
        "license": "MONARCH",
        "license_level": 3,
        "actions": [
            {
                "name": "TLALOC Protocol",
                "activation": "Protocol",
                "detail": "Your NHP can rapidly fire and retarget your weapons – far faster than thought. Until the start of your next turn, you may reroll each missed melee or ranged attack roll once, choosing a new target within the attack’s Range. If the attack was part of an area of effect, it must target a character in the same area. Any given target can't be hit more than once as part of the same action."
            }
        ],
        "description": "TLALOC-Class NHPs provide advanced multi-system targeting and co-pilot functions, taking over subroutine control to ensure persistent lock-on and engagement. With TLALOC installed and operational, a pilot can trust that their back is always covered, and every possible advantage exploited.<br>TLALOC clones are often stereotyped as hasty and impetuous, and they are well-known for having superiority complexes. Despite this, they are some of the most stable NHP clones. Leading subjectivity theorists suggest that the wide portfolio of control and sense of domination given to TLALOC units encourages a sense of contentment with their work and subjectivity parameters – as a result, they have a much longer cascade window. Thus far, this theory is consistently reproducible across all TLALOC units, although there is no similar correlation among other mil-spec NHP lines."
    },
    {
        "id": "lmkii_hunter_logic_suite",
        "name": "HUNTER LOGIC SUITE",
        "type": "Tech",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "source": "SSC",
        "license": "MOURNING CLOAK MK. II",
        "license_level": 2,
        "actions": [
            {
                "name": "Stalk Prey",
                "activation": "Invade",
                "detail": "You infect the target with a viral logic that wipes your image from their sensors. They treat you as Invisible until you next take damage from them. This can only affect one target at a time."
            },
            {
                "name": "Terrify",
                "activation": "Invade",
                "detail": "You infect the target with a viral logic that makes your mech appear horrifying. Until the end of their next turn, they become Impaired and cannot make any voluntary movements that bring them closer to you."
            }
        ],
        "description": "Built from interpreted strands of DHIYED paracode, SSC’s Hunter Logic is an agile computational memetic: a dual synthetic/VLS-vector systemic weapon capable of interfering with both a target’s computer and its crew."
    },
    {
        "id": "lmkii_singularity_motivator",
        "name": "SINGULARITY MOTIVATOR",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "source": "SSC",
        "license": "MOURNING CLOAK MK. II",
        "license_level": 2,
        "actions": [
            {
                "name": "Exposed Singularity",
                "activation": "Reaction",
                "frequency": "1/round",
                "trigger": "Your mech takes damage.",
                "detail": "You may immediately teleport to a free space within 1d6 spaces."
            }
        ],
        "description": "This unique gravitic power plant was first developed by SSC’s Exotic Materials Group for the first-generation Mourning Cloak. For subsequent models, engineers devised a system that allows pilots to – for a moment – open the grav containment system’s aperture, exposing a slice of naked singularity to realspace.<br>A naked singularity is difficult to perceive for both organics and synthetics, being similar to the heart of a black hole. The sudden exposure essentially removes the mech and its pilot from realtime. The user experiences around 10 seconds of subjective time – a brief window, in which they can act independently of local realtime.<br>SSC recommends against abuse of this system, as the effects of long-term exposure to local sidereal time are still unknown."
    },
    {
        "id": "lmkii_fade_cloak",
        "name": "FADE CLOAK",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "source": "SSC",
        "license": "MOURNING CLOAK MK. II",
        "license_level": 3,
        "actions": [
            {
                "activation": "Quick",
                "detail": "When activated, you immediately move out of phase with realspace, becoming intangible. While intangible, you may move through obstructions, but not end your turn within them. You cannot interact with any other object or character or be interacted with in any way (e.g., taking or dealing damage).<br>Roll 1d6 at the start of each of your turns: on 3 or less, you return to realspace until the start of your next turn; on 4+, you remain intangible.<br>This system remains active for the rest of the scene, or until you deactivate it as a quick action."
            }
        ],
        "description": "Representing SSC’s first successful manipulation of the “Firmament”, Firmament Affinity/Directed Entropy (FADE) cloaks must be fabricated according to the unique affinity signature of requisitioning pilots. They are rough tools: artificial affinity amplifiers that allow operators to access shallow layers of the Firmament, and thus “shimmer” – nudging their physical bodies between the causal and paracausal. The cloak enhances this effect by extruding a semiorganic membrane that wraps around the mech to provide an additional layer of protection.<br>At present, the long-term effects of affinity amplification on organic matter are unknown; before receiving clearance to operate a FADE cloak, pilots must agree to check in with their SSC personal concierge on a regular schedule. These check-ins include regular deposits of genetic material."
    }
]